//STEP010  EXEC PGM=IEFBR14
//DD1      DD   DSN=PROD.PAYROLL.INPUT,DISP=SHR
//BADJOB   JOB CLASS=A
//STEP020  EXEC PGM=SORT,REGON=4M
//DD1      DD   DSN=PROD.PAYROLL.OUTPUT,DISP=(NEW,CATLG,DELETE
//DD1      DD   DSN=PROD.PAYROLL.OUTPUT2,DISP=(NEW,CATLG,DELETE)
//BADDD    DD   DUMMY,DSN=SOME.DATASET
//NODATA   DD   DISP=SHR
//LONGDSN  DD   DSN=THIS.QUALIFIER.IS.WAYTOOLONGFORVALID.NAME.SERIOUSLY.TOO.LONG,DISP=SHR
//TIMEBAD  DD   DSN=A.B,DISP=SHR
//STEP030  EXEC PGM=P2,TIME=ABC
//SPBAD    DD   DSN=A.B,DISP=SHR,SPACE=(BADUNIT,(10,5))
//STEP040  EXEC PROC=NOSUCHPROC
//         IF (STEP020.RC = 0) THEN
//STEP050  EXEC PGM=P3
