//MYPROC   PROC LIB=PROD.LOAD,MEM=PGMA
//STEP1    EXEC PGM=&MEM
//STEPLIB  DD   DSN=&LIB,DISP=SHR
//OUT1     DD   DSN=&LIB..OUTPUT,DISP=SHR
//         PEND
//JOBA     JOB (ACCT),'ME',CLASS=A,MSGCLASS=X
//RUN1     EXEC PROC=MYPROC,MEM=PGMB
//STEP1.OUT1  DD DSN=OVERRIDE.DSN,DISP=SHR
//RUN2     EXEC MYPROC,LIB=PROD.LOAD2
//BADOVR   DD   DSN=X.Y,DISP=SHR
//RUN3     EXEC PROC=MYPROC,BADSYM=1
